Repository: jouissancetka/LMW
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 游小默转了转眼珠子，他已经在考虑干脆躲进空间。
en_us: You XiaoMo rolled his eyes. He was already considering the merits of simply hiding in his dimension.

source: 游小默转头去看凌霄，又被他说中了，河镇那个老人果然有问题，现在不用他们主动去找，他就安排好了。
en_us: You XiaoMo turned his head and looked at Ling Xiao. He had spoken correctly again; it seemed that the old man from River Town indeed had some problems. Now there was no need for them to go search on their own, as he had already arranged it for them.

source: 游小默转头就看到环形梯旁的柱子标着一个大大的‘九十五’，脑门滑下一滴冷汗，他想得太投入了，走着走着就走到这里了，“抱歉抱歉，我走过头了。”
en_us: You XiaoMo turned his head and saw that there was a large 'Ninety-Five' on the pillar next to the circular staircase. A drop of cold sweat slid down his face. He was too deep in his thoughts, and he just walked and walked till he reached this floor. "Apologies, apologies, I walked past my floor."

source: 游小默转头看一眼前方茂密的林子，林子黑漆漆的看起来没几个人，但闯进去就真的变成瓮中捉鳖，犹豫了下还是拐向一处人迹较少的建筑。
en_us: You XiaoMo turned his head and looked at the dense forest ahead. The inky-black forest seemed to be sparsely populated, but he would truly become a fish in the barrel (瓮中捉鳖) if he burst in. After hesitating for a moment, he turned into the direction of a building that had fewer signs of people.

source: 游小默转头，“为什么？”
en_us: You XiaoMo turned his head, "Why?"

source: 游小默转头，没等他去看凌霄的样子，就发现洁白的衣服上多了几滴刺眼的鲜血，吓得他声音都抖起来了，“你你你、你放我下来。”
en_us: You XiaoMo turned back and before he could see how Ling Xiao looked, he discovered a few glaring drops of blood on the spotlessly white clothes. It frightened so much that his voice was shaking, "You-you-you, you let me down."

source: 游小默转身就看到坐在第二排的一名青年正站着朝他挥挥手，青年给他的感觉有点熟悉。
en_us: You XiaoMo turned and saw a young man on the second row waving at him. The young man seemed familiar.

source: 游小默转过头看向他，“酒师？”
en_us: You XiaoMo turned towards him to ask, "Sommelier?"

source: 游小默转过身看向老者。
en_us: You XiaoMo turned to look at the elderly man.

source: 游小默转过身背对着星罗城主，眼瞅瞅的望着开始闪烁的传音石，在他求神拜佛念念有词的时候，闪光突然暗了下去并化为一层淡淡的光芒。
en_us: You XiaoMo turned so that his back was to the City Master, gazing at the flashing transmission stone . As he was beginning to pray for this to work, the flashing died down into a layer of weak light.

source: 游小默迅速的挡在凌霄面前，同时调动大量的灵魂之力防御，他自认为以他现在的实力应该能抵挡得下碧妖蛇，可是碧妖蛇却轻易撕开了他的防御，张牙舞爪的朝他扑了过来。
en_us: You XiaoMo quickly placed himself in front of Ling Xiao and mobilized his soul power to as a defense at the same time. He believed that his current strength should be enough to ward off the Jade Devil Snake but the it easily tore through his defense and pounced on him with bared fangs and brandished claws.

source: 游小默过来后就直接拿出上蒸笼。
en_us: When You XiaoMo came, they just had to take it out and steam it.

source: 游小默还不至于怕他，记得在星罗城遇到江流的时候，他的修为是九级上品，现在也不过是十级下品，分开后他的修为没有涨多少。
en_us: You XiaoMo wasn't afraid of him, after all, when they met Jiang Liu in Xing Luo City, he was still level nine, upper grade (九级上品). Even now he was just level ten, lower grade, so during their time apart, it didn't change much.

source: 游小默还以为乒乓只会咬禁制，没想到还有攻击力，趁星罗城主震惊得一时没有反应，他调转方向就跑。
en_us: You XiaoMo had thought that Ping Pang were only restricted to bites (咬禁制) and did not expect their bite to have such attack power. Taking advantage of the time where the City Master of Starfall City was so shocked that he was unable to react, he made a turn about and ran off.

source: 游小默还以为他出了什么事，一急就放弃逃出宫殿，立刻改道行驶。
en_us: Thinking that something happened, You XiaoMo changed course.

source: 游小默还以为老人知道他们为什么要找通灵玄龟，听他这么说才恍然大悟，忙问道：“那他们找到通灵玄龟了吗？”
en_us: You XiaoMo had assumed the old man had seen through their purpose of looking for the Psychic Black Turtles. He suddenly saw the light after listening to the old man and asked, "Then did they find the Psychic Black Turtles?"

source: 游小默还想说什么，凌霄已经切断联系了。
en_us: Before You XiaoMo could say anymore, Ling Xiao broke off contact.

source: 游小默还担心修为提涨太快会有后遗症，但见他什么事都没有才稍微放心。
en_us: You XiaoMo was even worried that there was going to be sideffects to such power increase but aftering see him perfectly fine, he was a bit relieved.

source: 游小默还是没忍住，搬了张凳子踩上去。
en_us: In the end, You XiaoMo couldn't resist the temptation and got a stool to step on it.

source: 游小默还是第一次见到这么急着前来送死的人。
en_us: This was the first time You XiaoMo had seen people who were so eager for death.

source: 游小默还是觉得不对，“你说只有正统的游族人才能继承传族之宝，可是我也不是正统的游族人啊！”
en_us: You XiaoMo still felt that something wasn't right. "You said that only direct descendants of the You Family could inherit the Inheritance Jewel, but I'm also not a direct descendant of the You Family!"

source: 游小默还是觉得现在的凌霄很不可思议，当真是转性了。
en_us: You XiaoMo still felt that the current Ling Xiao was very hard to believe. His character had really changed.

source: 游小默还没反应过来，他的‘队友’们就冲了出去。
en_us: His 'teammates' had rushed out before You XiaoMo could react.

source: 游小默还没有百分百的信任武成，所以自己回来的消息并没有透露给他知道，当他们找上门并说明就是游小默的时候，武成几乎傻眼了。
en_us: You XiaoMo hadn't given a hundred percent of his trust to Wu Cheng yet, thus he never hinted at his return to him. Once they arrived to say they were You XiaoMo, Wu Cheng was utterly dumbfounded.

source: 游小默这一拳用了七八分的力量，砸在脆弱的脑袋上，虽然没有像凌霄一样直接把脑袋砸破，但是也足够让玄泽喝一壶了。
en_us: This punch held seventy/eighty percent of You XiaoMo's power. Although it didn't smash through like Ling Xiao, on a fragile body part like the head, it was painful enough for Xuan Ze. (喝一壶了)

source: 游小默这个名字他们最近听过很多次，而且听闻雷老很申老头都对他很感兴趣，他们早就想见他一见。
en_us: They had heard the name You XiaoMo many times recently and they had long wanted to meet him after having heard news that Old Lei and Geezer Shen were very interested in him.

source: 游小默这么迫不及待也是有原因的，凌霄的内伤越早恢复对他们就越有利，他可没忘记游震天也在这里，要是一不小心碰到他就麻烦了。
en_us: You XiaoMo had his reasons for being in a rush. The faster Ling Xiao's wounds heal, the better it was for them. After all, he hadn't forgotten about You ZhenTian, who was also here. If they met by accident, it would be troublesome for them.

source: 游小默这句话正是莫景一直期盼着的，对他来说就像天籁之音。
en_us: This sentence from You XiaoMo was exactly what Mo Jing has been looking forward to. It sounded just like heavenly music (天籁之音) to him.

source: 游小默这才注意到原来还有这东西，跟巨无霸的一样。
en_us: It was only then that You XiaoMo noticed the items. They were the same as the ones in the Giganticus.

source: 游小默这次没有配合他露出一脸嫌弃的表情，“不行！
en_us: You XiaoMo didn't go along with him this time, and he revealed a displeased expression. "No!

source: 游小默这次没让他进房间，接过东西就把他打发走了。
en_us: This time, You XiaoMo didn't let him in but shooed his off after he took the stuff.

source: 游小默连听都没听说过。
en_us: You XiaoMo had never even heard of it before.

source: 游小默连忙将手指从小乌龟嘴里抽出来，一看果然被咬出个伤口，不过伤口流的血不多，好像被小乌龟当成好喝的东西吸走了。
en_us: You XiaoMo hurriedly withdrew his finger from the baby turtle's mouth. There was indeed a wound from the baby turtle's bite, but there wasn't much blood flowing from the wound, and it seemed that the baby turtle had sucked it up thinking that it was something tasty.

source: 游小默连忙拉住他，“如果他真的在里面，我们这样进去好吗，要是他生气了怎么办？”
en_us: You XiaoMo quickly pulled him back, "If he was really inside, can we just go in like this? What if he gets mad?"

source: 游小默连忙站起来，结果又被拉回去，只好转身傻兮兮的对男人笑道：“现在可是大白天的，而且哈市在别人的床上，你别乱来啊，晚上你不是还想吃我做的饭菜吗，会耽误的。”
en_us: You XiaoMo quickly stood up, but was pulled back again. He turned to and smiled foolishly at the other man: "It's the middle of the day, and we're in someone else's bed, don't mess around. Don't you want to eat my food tonight? It'll be delayed."

source: 游小默连忙缩进凌霄怀里，“没有，我只是在表达我很害怕。”
en_us: You XiaoMo promptly dived into Ling Xiao's embrace, "I'm not, I'm just expressing my fear."

source: 游小默连忙跟过去，“你说的未必是什么意思？”
en_us: You XiaoMo hastily caught up. "What do you mean by 'not necessarily'?"

source: 游小默连忙躲到凌霄身后。
en_us: You XiaoMo hurriedly ducked behind Ling Xiao.

source: 游小默连忙问道：“那要怎么样才能让我的金翅虫产出坚韧十倍的金丝。”
en_us: You XiaoMo hurriedly asked, "Then how do I let me Golden Winged Insects create silk ten times as strong?"

source: 游小默那好糖葫芦急忙追上去。
en_us: All You XiaoMo could do was hurry over while holding the sticks.

source: 游小默郁闷的抓抓头。
en_us: You XiaoMo scratched his head gloomily.

source: 游小默郑重的对他的契约兽们说道：“小金，小乒，小乓，你们守好出口，如果水元素之心逃出来，一定要帮我拦下它，要是被它逃了，克扣你们的伙食费哦。”
en_us: You XiaoMo solemnly spoke to his contracted demon beasts, "Xiao Jin, Xiao Ping, Xiao Pang, guard the exit carefully. If the water elemental essence wants to run, you have to stop it. If it manages to flee, I'll deduct your food."

source: 游小默都不想戳穿他了。
en_us: You XiaoMo didn't even want to expose him anymore.

source: 游小默鄙视他，如果是几条人命也就罢了，问题是集九镇少说也有几万人那么多，不可能不走漏风声。
en_us: You XiaoMo glared at him. If it was just a few people, then that wouldn't be a problem. However, JiJiu Town had thousands. It wouldn't be possible to silence them all for certain.

source: 游小默重新坐回座位，百无聊赖的翻着前面的书。
en_us: You XiaoMo returned to his seat and fliped through the book in front of him, hopelessly bored.

source: 游小默重新打起精神。
en_us: You XiaoMo once again braced himself.

source: 游小默长大嘴巴。
en_us: You XiaoMo's jaw dropped.

source: 游小默长大嘴巴，“幸好你把他们赶走了。”
en_us: You XiaoMo's mouth gaped open, "Good thing you chased them away."

source: 游小默问：“有什么问题？”
en_us: You XiaoMo asked, "What's the problem?"

source: 游小默问：“那都有什么办法？”
en_us: You XiaoMo asked, "What solutions are there?"

source: 游小默闲得发慌就带着他的呆萌小队和凌霄在鲸岛四处逛，途中买了不少鲸岛和其他岛屿的特产，实用和不实用的都买了一堆，有一些还是呆萌小队的玩具。
en_us: You XiaoMo was so bored that he took his silly-looking crew (呆萌小队) and Ling Xiao out to shop around Whale Island. Along the way he bought quite a bit of Whale Island and the surrounding islands' special goods, both practical and impractical items. Several were also the silly-looking crew's toys.

source: 游小默随口问道：“当初你说白虎可能受了重伤躲起来养伤，你说他现在会不会就在宫殿里？”
en_us: You XiaoMo asked off-handedly, "You said before that the white tiger could have suffered a grave injury and came here to rest. Do you think his going to be here?"

source: 游小默随手扔掉大刀，乘胜追击了过去。
en_us: You XiaoMo casually discarded the sword, dashing forwards in pursuit.

source: 游小默隐约猜到可能与黑蜘蛛举办的拍卖盛会有关，便也不意外，“好吧，那你算一算，看看这些东西需要多少灵晶。”
en_us: You XiaoMo got the vibe that it had something to do with the Black Spider's aution and wasn't surprised, "Okay, then calculate the total and tell me how much is it going to cost."

source: 游小默震惊的看着这一幕，凌霄该不会是想炸山吧？
en_us: You XiaoMo looked at this scene in shock, Ling Xiao couldn't be thinking of exploding the mountain ba?

source: 游小默震惊的看着闪闪发光的传音石，竟然真的联系上了，激动得他蹦了起来，太棒了！
en_us: You XiaoMo looked at the flickering and shining transmission stone in shock. He actually managed to connect and was so excited that he started bouncing around. This was great!

source: 游小默震惊，“你们不知道？”
en_us: You XiaoMo was shocked. "You guys don't know?"

source: 游小默震惊，“难道你想救莫雪姐妹？”
en_us: You XiaoMo was shocked. "You want to save Mo Xue and her sister?"

source: 游小默霎时掉了一地鸡皮疙瘩，这个人这是在跟他……撒娇？
en_us: You XiaoMo felt goosebumps rise on his arms; was she… playing coy?

source: 游小默露出一副咬牙切齿的表情，在他的价格上又加了五十万灵晶，这次数目少了很多，让麟昊武以为已经接近他的底线，这样他就不敢胡乱加价了。
en_us: You XiaoMo added five million more spirit gems as he grinded his teeth. This number was a lot less so as to make Lin HaoWu think he was at his limit and thus not randomly add anymore more.

source: 游小默露出满意的神色，视线又射向大鹏鸟和吞金兽。
en_us: You XiaoMo revealed a satisfied expression as his gaze shot to the Roc and the Metal Swallowing Beast.

source: 游小默露出胜利的微笑，敢当着他的脸说凌霄的坏话，不噎死你我就不叫游小默，再者他的话也没有错，因为一个三星打败一星确实算不得真本事。
en_us: You XiaoMo smiled in triumph. If you dared to diss Ling Xiao in front of him, then you had better prepare to be roasted (敢当着他的脸说凌霄的坏话，不噎死你我就不叫游小默). Plus, he wasn't wrong, there was nothing amazing about a 3 star defeating a 1 star.

source: 游小默靠在凌霄怀里，“我伤心了，第一次英雄救美竟然还被埋怨没有立刻出手，世上怎么会有这么不要脸的人！”
en_us: You XiaoMo leaned back into Ling Xiao's embrace, "I'm so sad. My first 'hero saves the maiden' (英雄救) even complained that I did not immediately make a move. How can there be such a shameless person in the world?!"

source: 游小默面不改色，别忘了他已经是彩级一品，虽然跟他比差了点。
en_us: You XiaoMo stayed unfazed. Don't forget, he was already a first grade rainbow level, though he wasn't to the other's level yet.

source: 游小默面无表情，看上去不为所动，心里却不停吐糟着。
en_us: On the outside, You XiaoMo was expressionless, as if he wasn't moved at all, but on the inside, he called bullshit. (吐糟)

source: 游小默顺着他的视线看到床边凌乱堆着的衣服，脸色一变，这不是凌霄从他身上脱下的衣服，突然进入空间他没来得及收拾，如果真有人进来，看到衣服岂不是猜到他们做过什么？
en_us: You XiaoMo followed his line of sight and saw the messy pile of clothes beside the bed. His expression changed. Wasn’t these the clothes that Ling Xiao had stripped off him? He did not have time to clean up since they suddenly entered the dimension. If someone really came in and saw the clothes, wouldn't they be able to guess what they had done?

source: 游小默顺着他的视线看向自己胸前的衣服，不知什么时候，吞金兽和两只金翅虫都钻出一颗小脑袋，挂在他的胸口上摇摇晃晃。
en_us: You XiaoMo followed his line of sight and looked at his clothes. At some point, the Metal Swallowing Beast and the two Golden Winged Insects had poked their small heads out, wobbly hanging on his chest.

source: 游小默顺着地图的指示终于找到他的目标，四周的水元素果然越来越浓郁。
en_us: You XiaoMo finally found his target using the map and, as expected, the water element around him grew denser.

source: 游小默顺着感觉看过去，猝不及防接触到游震天的视线，那是一双志在必得却极其隐晦的贪婪眼神，好像要把他整个人解剖了一样，一瞬间他就有种灵魂要被洞穿的感觉，感觉太糟心了。
en_us: You XiaoMo looked in the direction of the gaze and met You ZhenTian's eyes. His gaze was determined yet greedy, as if he was trying to dissect You XiaoMo. In that moment, he felt as if his entire soul was being penetrated. It was a terrible feeling.

source: 游小默顿时一脸黑线。
en_us: You XiaoMo felt black lines coming down his face.

source: 游小默顿时哭笑不得。
en_us: You XiaoMo didn't know if he should laugh or cry.

source: 游小默顿时急的团团转。
en_us: You XiaoMo was so panicky he started running around in circles.

source: 游小默顿时恍然大悟，拍手道：“我知道了，芥子空间一崩溃，宝贝就会掉在战场上是不是，所以那些来白骨小镇的人，大都是来寻宝的。”
en_us: You XiaoMo immediately saw the light as he clapped his hands, "I know! Once the mustard seed dimension collapses, the treasures would drop onto the battlefield right? So most of all these people who came to White Bone Town are here for a treasure hunt."

source: 游小默顿时眯起眼，将他推回去，抬起一条腿跨坐在他身上，表情凶猛：“你到底说不说，不知道好奇心能杀死人吗？”
en_us: You XiaoMo immediately narrowed his eyes and pushed him back. He lifted a leg and straddled him as he fiercely scowled, "Are you going to spit it out or not? Don't you know that curiosity can kill people?"

source: 游小默顿时蔫了，“好吧，我承认我错了，我以后再也不敢了，你说东我绝对不敢往西，所以你快拿金库的宝贝来救我。”
en_us: You XiaoMo immediately whithered. "Alright, I admit I was wrong. I'll never do it again. If you say east, I won't dare go west, so hurry and come over with the vault treasures to save me."

source: 游小默顿时被凌霄的干脆噎了一下，他刚刚还在期待凌霄的料事如神，白期待了，想了想，他不甘的问道：“你怎么就确定他们在找人？”
en_us: You XiaoMo was suddenly choked by Ling Xiao's blunt statement. He was just expecting Ling Xiao to prophesy with supernatural accuracy and it seemed that he had been waiting for nothing. After thinking about it, he unwillingly asked, "How are you so sure that they are looking for someone?"

source: 游小默顿时觉得真相恐怕会很遥远。
en_us: At that moment, You XiaoMo felt like the truth was still very faraway.

source: 游小默顿时起了一身鸡皮疙瘩，为什么他觉得这句‘小哈’像是加了蜜糖一样甜腻，难道在他闭关这段时间发生了什么他不知道的事情？
en_us: You XiaoMo immediately felt goosebumps rise across his body. Why did it feel like that “XiaoHa” had a strange layer of sweetness to it. Had something happened while he had been isolation.

source: 游小默顿时露出一脸痛惜的表情。
en_us: You XiaoMo immediately let out an expression of lament.

source: 游小默顿觉搞笑，“愿赌服输，他输了是他自己技不如人，你这是什么意思，当着大家的面想告诉我们老鹰会输不起是吗？”
en_us: You XiaoMo immediately thought this funny. "This was a willing bet. His loss was because he wasn't as strong as I am. What do you mean by this? Are you telling everyone that your Old Eagle Guild is full of sore losers?"

source: 游小默颤抖地问道：“干、干什么？”
en_us: You XiaoMo’s voice shook as he asked, “Wh-what?”

source: 游小默飞出近千米远，落在一颗粗壮的大树上，树龄似乎超过千年，但是已经没有生命气息了，只剩下光秃秃的躯干。
en_us: You XiaoMo flew out by around a kilometer, landing on a thick tree. The tree seemed over a thousand years old, but had long since lost any signs of life, leaving behind an empty shell.

source: 游小默飞到玄泽身边，不看不知道，一看吓一跳。
en_us: You wouldn't know until you see it, but when You XiaoMo flew over to Xuan Ze, he was completely taken back.

source: 游小默飞行的速度并不慢，但是在它们看在，却慢得像乌龟在爬，一双双发绿的眼睛紧紧的盯着他的一举一动。
en_us: You XiaoMo didn't actually fly that slowly, but from their perspective, he flew as slowly as a turtle crawling. Many pairs of glowing green eyes followed his every movement.

source: 游小默骄傲的抬起下巴，“当然是我做的，不然你以为是谁？”
en_us: You XiaoMo proudly lifted his chin. "Of course I made it, who else did you think it was?"

source: 游小默骑在他身上，气愤难平的捶着他的胸口，真是有够恶劣的家伙，竟然这样整蛊他，明知道他很在意。
en_us: You XiaoMo sat astride on him, indignantly (气愤难平) beating Ling Xiao's chest with his fist, not to be appeased. He was truly an extremely nasty guy, to go as far as to mess with him till he went crazy when Ling Xiao knew that he was very concerned about this.

source: 游小默默默的往他房间的隔壁看了一眼，应该是经过的时候再顺便看一眼吧？
en_us: You XiaoMo silently glanced towards the room next door to him. Should he check up on things when he goes past?

source: 游小默默默的抹了把汗，真是凶残！
en_us: You XiaoMo discretely wiped away some sweat. That sure was savage!

source: 游小默默默的鄙夷了他一下，连替自家夫人倒杯茶都不肯，太差劲了，“我们接下来还要留下来吗？”
en_us: You Xiao silently cast a despicable glare at him for a while. He wasn't even willing to pour a cup of tea for his family's wife, it's too disappointing (太差劲了), "Will we continue to stay?"

source: 游小默，“……”是你妹啊！
en_us: You XiaoMo, "..." No, my ass!

source: 游小默，“……我会的。”
en_us: You XiaoMo: “… I will.”

source: 游小默：“……”好吧，他问错人了，哦不，是兽。
en_us: ]You XiaoMo: “…” Well, ok, he asked the wrong person, uh, beast.

source: 游小默：“……”
en_us: You XiaoMo, “…”

source: 游小默：“……”当他没问！
en_us: You XiaoMo, "..." Pretend that he didn't ask!

source: 游小默：“……”逗我玩呢。
en_us: You XiaoMo, "..." You're making fun of me. (逗我玩呢)

source: 游小默：“……下次能早点说吗？”
en_us: You XiaoMo: "... Can you tell me earlier next time?"

source: 游戏的戏子是莫雪和莫菲，以及夏音的两名女侍。
en_us: The actors of the play were Mo Xue and Mo Fei, as well as Xia Yin's two attendants.

source: 游震天对左炎还算客气，虽然摆着长辈的架势，但言语间却听得出来他没有轻忽这个小辈。
en_us: You ZhenTian was courteous to Zuo Yan. Though he held the bearing of an elder, his tone made it clear that he didn't look down on the younger.

source: 游震天带着威气凌人的威严走出来，面容严肃的像个裁决者，听到他的话便冷笑一声，“无缘无故的离席，若没有目的恐怕没有人相信，想知道是不是你朋友抓走赤血家族的弟子，只要把他找出来当面对质就知道。”
en_us: You ZhenTian walked out with an imposing air, his expression as serious as a judge. Hearing what the other said, he sneered, "If you had no agenda for leaving early without a reason, no one would believe you. If we want to figure out if your friend took a disciple of our family, we'd just have to bring him back and interrogate him."

source: 游震天一惊，身体迅速的往后退，不过却来不及了。
en_us: You ZhenTian was alarmed and he rapidly retreated backwards, but it was too late.

source: 游震天不得不怀疑，因为在龙翔大陆修为还是神境，怎么可能在短短一年之内就晋级为圣境，就算他和麒麟族和妖凰族有关系，晋级也不可能如此之快。
en_us: You ZhenTian couldn't help but doubt this, because at the LongXiang Continent, that person had only been Divine level, how could it be possible for him to breakthrough to Sacred level in just a year? Even if he had something to do with the Qilin Clan and Demon Phoenix Clan, he still shouldn't be able to advance so quickly.

source: 游震天也想在傅苍穹几人赶过来的时候将游小默带走，以免横生枝节，若是传族之宝的事情泄露出去，他要面对的就不是傅苍穹和玄正，而是包括妖凰族麒麟族等势力在内的强者。
en_us: You ZhenTian also wanted to take You XiaoMo away before Fu CangQiong and the rest caught up, in order to avoid raising unexpected difficulties. If the news about the Inheritance Jewel was leaked outside, he wouldn't just have to face Fu CangQiong and Xuan Zheng, but also the Demon Phoenix Clan's, Qilin Clan's, and the rest of the major power's experts.

source: 游震天冷哼一声。
en_us: You ZhenTian harrumphed.

source: 游震天分明感觉到一股比一星更强大的能量，尽管震惊，但他并没有慌张，他也没时间慌张，就算是五星也不是他的对手。
en_us: You ZhenTian clearly felt a strength that was much higher than one star. Although he was shocked, neither did he panic nor did he have time to panic. Ling Xiao was not his opponent even if he was at five stars.

source: 游震天却在看到这枚戒指后反常的皱起眉头，这枚戒指让他想到那个被他陷害的弟弟，当初他被选为赤血家族下一任家住继承人后，长老们给了他一枚戒指，就是游小默手中这枚。
en_us: However, strangely, when You ZhenTian saw the ring, he furrowed his brows. The ring reminded him of his little brother, the one he framed (陷害). When he was chosen to become the next successor of the Vermillion Blood Clan, the elders gave him a ring, the one in You XiaoMo's hands.

source: 游震天只觉得疑点太多，眼下也不可能立刻理出头绪，便暂时不去想，转头看向身边人。
en_us: You ZhenTian felt that there were too many uncertainties. He couldn't digest this all and come up with a decision immediately, so he threw it to the back of his mind for now and turned to look at the person next to him.

source: 游震天后面参与竞价的时候，游小默倒是没有再煽风点火，很多人都认为他怕了。
en_us: You XiaoMo did not fan the flames again when You ZhenTian participated in the bidding for the items coming after. Many people assumed that he was afraid now.

source: 游震天咬牙切齿的说完这句话，立刻加快速度，他准备在凌霄出手前先出手抢占先机。
en_us: You ZhenTian gnashed his teeth as he snarled. Then he immediately put on a burst of speed, preparing to make a preemptive move before Ling Xiao could strike.

source: 游震天将近段时间发生的所有事情都串起来，再加上江流的证词，终于确信了一件事，游小哈就是游小默，凌默就是凌霄！
en_us: You ZhenTian put together all the incidents that had happened recently and with the addition of Jiang Liu's testimony, he was finally convinced that You XiaoHa was You XiaoMo and Ling Mo was Ling Xiao!

source: 游震天并不知道这件事，毕竟事隔太久，所以就算他把游小默抓回去，他也得不到传族之宝。
en_us: You ZhenTian didn't know of this. In the end, too much time had passed, so even if he captured You XiaoMo, he would be unable to get the Inheritance Jewel.

source: 游震天并没有成名武器，不过他的拳头与脚却比武器还要更强大，一拳就饱含着毁天灭地的震撼，拳头所过之处，四周的空间都扭曲起来。
en_us: You ZhenTian didn't have any famous weapons, but his fists and feet were even more powerful than a weapon. One of his fists alone contained the ability to shake the heavens and the earth, and wherever his fist went, the space around it became distorted.

source: 游震天并没有立刻上来，这股威压不过是他给这里年轻人们一个下马威罢了，大家也没有想到，游震天本人竟然会亲自过来，这可是大新闻。
en_us: You ZhenTian did not come up immediately. This pressure was only him giving an initial sow of strength to the youngsters here. Everyone also did not think that You ZhenTian would personally come. This was really big news.

source: 游震天当他是死鸭子嘴硬，表情阴狠的说道：“看在你身上有麒麟族和妖凰族的血脉，我就大发慈悲给你留一具全尸好了，我让你见识一下我游震天真正的实力！”
en_us: You ZhenTian took it as him stubbornly refusing to admit defeat and he said with a dark and ruthless expression, "Since you have both the Demon Phoenix Clan's and Qilin Clan's bloodlines, I'll show mercy and leave you with an intact corpse. I'll let you experience my You ZhenTian's true strength!"

source: 游震天往下面看了眼碧妖蛇掉下去的地方，现在他也没时间去看它死了没有，心中对游小默的愤怒已经不亚于凌霄。
en_us: You ZhenTian looked down at the place where the Jade Devil Snake had fallen. He did not have the time to see if it was dead now. His anger towards You XiaoMo was currently not any lesser than his anger towards Ling Xiao.

source: 游震天得知传族之宝极有可能被开启后，心中的震惊根本无法用言语来形容。
en_us: The astonishment in You ZhenTian's mind was simply indescribable after knowing that it was extremely possible that the Inheritance Jewel had been activated.

source: 游震天恼怒道：“傅苍穹，你若一定要护他们就是与赤血家族为敌，为了他们二人，你确定要挑起赤血家族与苍盟的战争吗？”
en_us: You ZhenTian was enraged, "Fu CangQiong, the ChiXue Clan will take you as an enemy if you are determined to protect them. Are you sure you want to incite a war between the ChiXue Clan and the Cang Alliance for the sake of both of them?"

source: 游震天挑起浓眉，“倒是有两下子。”
en_us: You ZhenTian raised his thick eyebrows. "Indeed, you have a few tricks up your sleeve."

source: 游震天是一名圣境高星强者，整个通天大陆能与他一拼的也就只有那么几个人，凌霄虽然有麒麟族和妖凰族的血脉，说到底还是个晚辈，就算他也是一名圣境强者，但是仍然有几星的差距。
en_us: You ZhenTian was a Sacred high-star level expert (圣境高星强者), and there were only those few people who could stand on the same level as him in all of TongTian Continent. Even though Ling Xiao had the bloodlines of the Qilin Clan and the Demon Phoenix Clan, in the end he was still considered part of the younger generation. Although he was also a Sacred Realm expert, there was still a few stars' worth of difference.
